vas/app/controllers/externcall_controller.rb

INSERT INTO `externcalls` (`a`, `b`, `created_at`, `updated_at`) VALUES (NULL, NULL, '2011-07-29 12:17:36', '2011-07-29 12:17:36')
---
   def new
    @externcall = Externcall.create({:a => params[:a], :b => params[:b]})