vas/app/controllers/incomings_controller.rb

SELECT `incomings`.* FROM `incomings` ORDER BY incomings.id DESC LIMIT 1
---
  def index
   @incoming = Incoming.all

INSERT INTO `incomings` (`cid_number`, `exten_number`, `created_at`, `updated_at`, `exten_id`) VALUES (NULL, NULL, '2011-07-29 11:28:09', '2011-07-29 11:28:09', NULL)
---
  def new
    @incoming = Incoming.create({:exten_number => params[:exten_number], :cid_number => params[:cid_number]})