vas/app/views/incomings/_incoming.html.erb

SELECT `incomings`.* FROM `incomings` ORDER BY incomings.id DESC LIMIT 1
---
<li>
  <span class="created_at" data-exten = <%=Incoming.last.exten_number%> data-user_id = "4416" ><%= incoming.created_at.strftime("%H:%M") %></span>